# GetRebarInSystemIds Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AreaReinforcement..::..GetRebarInSystemIds Method
AreaReinforcement Class See Also
---
Returns the ids of the RebarInSystem elements owned by the AreaReinforcement element.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public IList<ElementId> GetRebarInSystemIds()
```

Visual Basic
---
```text
Public Function GetRebarInSystemIds As IList(Of ElementId)
```

Visual C++
---
```text
public:
IList<ElementId^>^ GetRebarInSystemIds()
```

# Remarks
The RebarInSystem elements are only created if ReinforcementSettings.HostStructuralRebar is set to true. If that setting is false, this function returns an empty array.
# See Also
AreaReinforcement Class
Autodesk.Revit.DB.Structure Namespace